Revit 2025 API
DecimalSymbol Enumeration
 The symbol used to separate the integer and fractional parts of a number.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DecimalSymbol
Public Enumeration DecimalSymbol
public enum class DecimalSymbol
type DecimalSymbol
Members
Member name | Value | Description
Dot | 0 |  A dot (".").
Comma | 1 |  A comma (",").
See Also
Reference
Autodesk.Revit.DB Namespace